# 2. Напишите программу, которая принимает на вход число N
#    и выдает набор произведений чисел от 1 до N.
#    1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
#    Пример:
#    - 4 -> [1, 2, 6, 24]
#    - 6 -> [1, 2, 6, 24, 120, 720]

num = int(input('Введите число => '))
data = []
value = 1
for i in range(1, num+1):
    data.append(value)
    value = data[i-1]*(i+1)
print(data)
